In [87]:
import os
import sqlite3
os.getcwd()

'/content'

**CREATE AND CONNECT DATABASE**

In [88]:
connection = sqlite3.connect('Abhish1.db')
crsr = connection.cursor()

**CREATE A TABLE**

In [89]:
sql_command="""
    CREATE TABLE IF NOT EXISTS Ages (
        name VARCHAR(128),
        age INTEGER
    );"""
crsr.execute(sql_command)

**DELETE EVERYTHING FROM TABLE(AGES)**

In [90]:
crsr.execute('DELETE FROM Ages')

**FETCH DATA FROM TABLE (NOW TABLE WILL BE BLANK DUE TO DELETE QUERY IN PREVIOUS CELL)**

In [91]:
crsr.execute("SELECT * FROM Ages")
data=crsr.fetchall()
for j in data:
  print(i)

**INSERT THE DATA IN TABLE**

In [92]:
sql_command="""INSERT INTO Ages VALUES ('Mara', 28);"""
crsr.execute(sql_command)
sql_command="""INSERT INTO Ages VALUES ('Otto', 33);"""
crsr.execute(sql_command)
sql_command="""INSERT INTO Ages VALUES ('Fyn', 31);"""
crsr.execute(sql_command)
sql_command="""INSERT INTO Ages VALUES ('Neshawn', 17);"""
crsr.execute(sql_command)
connection.commit()

**FETCH THE DATA IN TABLE**

In [93]:
crsr.execute("SELECT * FROM Ages")
data=crsr.fetchall()
for i in data:
  print(i)

('Mara', 28)
('Otto', 33)
('Fyn', 31)
('Neshawn', 17)

**SQL COMMAND**

In [94]:
crsr.execute("SELECT hex(name || age) AS X FROM Ages ORDER BY X")
result_set=crsr.fetchall()
for k in data:
  print(k)

('Mara', 28)
('Otto', 33)
('Fyn', 31)
('Neshawn', 17)

**FIND FIRST ROW AND RESULTING RECORD SET**

In [95]:
# Find and print the first row
if result_set:
    first_row = result_set[0][0]
    print("The first row in the resulting record set:", first_row)
connection.close()

The first row in the resulting record set: 46796E3331

In [96]:
long_string="53656C696E613333"